### Terraform Plan (Infra)

```
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-099c79fef1ac5dad0]
module.eks.module.eks.data.aws_caller_identity.current[0]: Reading...
module.eks.module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/redis-eks-cluster/cluster]
module.eks.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.vpc.module.vpc.data.aws_partition.current[0]: Reading...
module.vpc.data.aws_availability_zones.available: Reading...
module.eks.module.eks.data.aws_partition.current[0]: Reading...
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Reading...
module.eks.module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.vpc.module.vpc.data.aws_region.current[0]: Reading...
module.vpc.module.vpc.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.eks.module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.vpc.module.vpc.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.eks.module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.eks.module.eks.aws_iam_role.this[0]: Refreshing state... [id=redis-eks-cluster-cluster-20250422121209677400000003]
module.vpc.module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20250422121209676000000001]
module.eks.module.eks.data.aws_iam_policy_document.custom[0]: Reading...
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Read complete after 0s [id=692975265565]
module.eks.module.eks.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
module.eks.module.eks.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::692975265565:policy/redis-eks-cluster-cluster-20250422121209676000000002]
module.eks.module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=692975265565]
module.eks.module.eks.data.aws_iam_session_context.current[0]: Reading...
module.eks.module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:iam::692975265565:user/unzer]
module.eks.module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=692975265565]
module.eks.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=redis-eks-cluster-cluster-20250422121209677400000003-20250422121210498500000005]
module.eks.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=redis-eks-cluster-cluster-20250422121209677400000003-20250422121210496400000004]
module.eks.module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=4019367020]
module.eks.module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=9d97f51e-ef45-4224-8c75-136ebf0d41ce]
module.eks.module.eks.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=redis-eks-cluster-cluster-20250422121209677400000003-20250422121210518600000006]
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.eks.module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/redis-eks-cluster]
module.eks.module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::692975265565:policy/redis-eks-cluster-cluster-ClusterEncryption20250422121232093400000015]
module.eks.module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=redis-eks-cluster-cluster-20250422121209677400000003-20250422121232612600000016]
module.vpc.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-04ac9a802bc81ddfc]
module.vpc.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-03f0bb485bb877b6f]
module.eks.module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-04bf20b08fc1f39ff]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-096c467443065e040]
module.eks.module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-03ee6c230327a303a]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ead3f63ba5e57089]
module.vpc.module.vpc.aws_cloudwatch_log_group.flow_log[0]: Refreshing state... [id=/aws/vpc-flow-log/vpc-099c79fef1ac5dad0]
module.vpc.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-09518bc61113f79d1]
module.eks.aws_security_group.eks_workers: Refreshing state... [id=sg-06c7aa7988ac80037]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-00479278df7ed535f]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-03d87976d856d74d2]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0ba904340fb504f9f]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0c3ce30deb00138a4]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0787053b45f8a1da6]
module.vpc.module.vpc.aws_flow_log.this[0]: Refreshing state... [id=fl-087c7f69e162d5442]
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=1939002269]
module.vpc.module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=arn:aws:iam::692975265565:policy/vpc-flow-log-to-cloudwatch-2025042212122440990000000c]
module.eks.module.eks.module.eks_managed_node_group["main"].data.aws_partition.current: Reading...
module.eks.module.eks.module.eks_managed_node_group["main"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks.module.eks_managed_node_group["main"].data.aws_caller_identity.current: Reading...
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-1790838024]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-2164501234]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-3630739685]
module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-2756086294]
module.eks.module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-2603467923]
module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1649145]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-2963300031]
module.eks.module.eks.module.eks_managed_node_group["main"].data.aws_caller_identity.current: Read complete after 0s [id=692975265565]
module.eks.module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-3430840973]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-2751226526]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-3556863348]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0138d56e042968b66]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-071e0b8f68a824898]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-03d87976d856d74d21080289494]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0986997a85b639bb8]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-06c6f17e6ebb91c1b]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0f90a123d775355a1]
module.vpc.module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20250422121209676000000001-2025042212122495640000000e]
module.eks.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3449940004]
module.eks.module.eks.module.eks_managed_node_group["main"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks.module.eks_managed_node_group["main"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks.module.eks_managed_node_group["main"].aws_iam_role.this[0]: Refreshing state... [id=managed-node-group-eks-node-group-2025042212122757850000000f]
module.eks.module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=redis-eks-cluster]
module.eks.module.eks.module.eks_managed_node_group["main"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=managed-node-group-eks-node-group-2025042212122757850000000f-20250422121228706500000014]
module.eks.module.eks.module.eks_managed_node_group["main"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=managed-node-group-eks-node-group-2025042212122757850000000f-20250422121228454300000012]
module.eks.module.eks.module.eks_managed_node_group["main"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=managed-node-group-eks-node-group-2025042212122757850000000f-20250422121228624600000013]
module.eks.module.eks.module.eks_managed_node_group["main"].aws_iam_role_policy_attachment.additional["AmazonEBSCSIDriverPolicy"]: Refreshing state... [id=managed-node-group-eks-node-group-2025042212122757850000000f-20250422121228380400000011]
module.eks.module.eks.module.eks_managed_node_group["main"].aws_iam_role_policy_attachment.additional["AmazonEKSClusterPolicy"]: Refreshing state... [id=managed-node-group-eks-node-group-2025042212122757850000000f-20250422121228188600000010]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-04ff02eac8478a99a]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0787053b45f8a1da61080289494]
module.eks.module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=redis-eks-cluster:arn:aws:iam::692975265565:user/unzer]
module.eks.module.eks.time_sleep.this[0]: Refreshing state... [id=2025-04-22T12:23:02Z]
module.eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::692975265565:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/B5ACCF8C24F4379B3CE8F068B23B1012]
module.eks.module.eks.module.eks_managed_node_group["main"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=1567247730561888867]
module.eks.module.eks.module.eks_managed_node_group["main"].aws_launch_template.this[0]: Refreshing state... [id=lt-097ecaa1c08e7b660]
module.eks.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0]: Refreshing state... [id=redis-eks-cluster:managed-node-group-20250422122308968300000019]
module.eks.module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=redis-eks-cluster:kube-proxy]
module.eks.module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=redis-eks-cluster:coredns]
module.eks.module.eks.aws_eks_addon.this["aws-ebs-csi-driver"]: Refreshing state... [id=redis-eks-cluster:aws-ebs-csi-driver]
module.eks.module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=redis-eks-cluster:vpc-cni]
module.eks.module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=redis-eks-cluster#arn:aws:iam::692975265565:user/unzer#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.helm_release.grafana: Refreshing state... [id=grafana]
module.eks.helm_release.prometheus: Refreshing state... [id=prometheus]
module.eks.kubernetes_secret.grafana_secret: Refreshing state... [id=monitoring/grafana-secret]
module.eks.kubernetes_namespace.redis: Refreshing state... [id=redis]
module.eks.kubernetes_namespace.monitoring: Refreshing state... [id=monitoring]
module.eks.module.aws-auth.kubernetes_config_map.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.eks.kubernetes_secret.redis_secret: Refreshing state... [id=redis/redis-secret]
module.eks.helm_release.redis: Refreshing state... [id=redis-cluster]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
        id                     = "redis-eks-cluster:managed-node-group-20250422122308968300000019"
      + labels                 = {}
        tags                   = {
            "Name" = "managed-node-group"
        }
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.aws_security_group.eks_workers will be updated in-place
  ~ resource "aws_security_group" "eks_workers" {
        id                     = "sg-06c7aa7988ac80037"
        name                   = "redis-eks-cluster-worker-sg"
        tags                   = {
            "Name"                                    = "redis-eks-cluster-worker-sg"
            "kubernetes.io/cluster/redis-eks-cluster" = "owned"
        }
      ~ tags_all               = {
          + "Team"                                    = "SRE/Devops"
            # (5 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.eks.module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "aws-ebs-csi-driver"
      + id                 = (known after apply)
      + kubernetes_version = "1.32"
      + most_recent        = true
      + version            = (known after apply)
    }

  # module.eks.module.eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "coredns"
      + id                 = (known after apply)
      + kubernetes_version = "1.32"
      + most_recent        = true
      + version            = (known after apply)
    }

  # module.eks.module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "kube-proxy"
      + id                 = (known after apply)
      + kubernetes_version = "1.32"
      + most_recent        = true
      + version            = (known after apply)
    }

  # module.eks.module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.32"
      + most_recent        = true
      + version            = (known after apply)
    }

  # module.eks.module.eks.data.tls_certificate.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = "https://oidc.eks.us-east-1.amazonaws.com/id/B5ACCF8C24F4379B3CE8F068B23B1012"
    }

  # module.eks.module.eks.aws_cloudwatch_log_group.this[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "this" {
        id                = "/aws/eks/redis-eks-cluster/cluster"
        name              = "/aws/eks/redis-eks-cluster/cluster"
        tags              = {
            "Name" = "/aws/eks/redis-eks-cluster/cluster"
        }
      ~ tags_all          = {
          + "Team"        = "SRE/Devops"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_eks_access_entry.this["cluster_creator"] will be updated in-place
  ~ resource "aws_eks_access_entry" "this" {
        id                = "redis-eks-cluster:arn:aws:iam::692975265565:user/unzer"
        tags              = {}
      ~ tags_all          = {
          + "Team"        = "SRE/Devops"
            # (3 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] will be updated in-place
  ~ resource "aws_eks_addon" "this" {
      ~ addon_version               = "v1.41.0-eksbuild.1" -> (known after apply)
        id                          = "redis-eks-cluster:aws-ebs-csi-driver"
        tags                        = {}
      ~ tags_all                    = {
          + "Team"        = "SRE/Devops"
            # (3 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.module.eks.aws_eks_addon.this["coredns"] will be updated in-place
  ~ resource "aws_eks_addon" "this" {
      ~ addon_version               = "v1.11.4-eksbuild.2" -> (known after apply)
        id                          = "redis-eks-cluster:coredns"
        tags                        = {}
      ~ tags_all                    = {
          + "Team"        = "SRE/Devops"
            # (3 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.module.eks.aws_eks_addon.this["kube-proxy"] will be updated in-place
  ~ resource "aws_eks_addon" "this" {
      ~ addon_version               = "v1.32.3-eksbuild.2" -> (known after apply)
        id                          = "redis-eks-cluster:kube-proxy"
        tags                        = {}
      ~ tags_all                    = {
          + "Team"        = "SRE/Devops"
            # (3 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.module.eks.aws_eks_addon.this["vpc-cni"] will be updated in-place
  ~ resource "aws_eks_addon" "this" {
      ~ addon_version               = "v1.19.3-eksbuild.1" -> (known after apply)
        id                          = "redis-eks-cluster:vpc-cni"
        tags                        = {}
      ~ tags_all                    = {
          + "Team"        = "SRE/Devops"
            # (3 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.module.eks.aws_eks_cluster.this[0] will be updated in-place
  ~ resource "aws_eks_cluster" "this" {
        id                            = "redis-eks-cluster"
        name                          = "redis-eks-cluster"
        tags                          = {
            "terraform-aws-modules" = "eks"
        }
      ~ tags_all                      = {
          + "Team"                  = "SRE/Devops"
            # (4 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "oidc_provider" {
        id              = "arn:aws:iam::692975265565:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/B5ACCF8C24F4379B3CE8F068B23B1012"
        tags            = {
            "Name" = "redis-eks-cluster-eks-irsa"
        }
      ~ tags_all        = {
          + "Team"        = "SRE/Devops"
            # (4 unchanged elements hidden)
        }
      ~ thumbprint_list = [
          - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_iam_policy.cluster_encryption[0] will be updated in-place
  ~ resource "aws_iam_policy" "cluster_encryption" {
        id               = "arn:aws:iam::692975265565:policy/redis-eks-cluster-cluster-ClusterEncryption20250422121232093400000015"
        name             = "redis-eks-cluster-cluster-ClusterEncryption20250422121232093400000015"
        tags             = {}
      ~ tags_all         = {
          + "Team"        = "SRE/Devops"
            # (3 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_iam_policy.custom[0] will be updated in-place
  ~ resource "aws_iam_policy" "custom" {
        id               = "arn:aws:iam::692975265565:policy/redis-eks-cluster-cluster-20250422121209676000000002"
        name             = "redis-eks-cluster-cluster-20250422121209676000000002"
        tags             = {}
      ~ tags_all         = {
          + "Team"        = "SRE/Devops"
            # (3 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
        id                    = "redis-eks-cluster-cluster-20250422121209677400000003"
        name                  = "redis-eks-cluster-cluster-20250422121209677400000003"
        tags                  = {}
      ~ tags_all              = {
          + "Team"        = "SRE/Devops"
            # (3 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group.cluster[0] will be updated in-place
  ~ resource "aws_security_group" "cluster" {
        id                     = "sg-04bf20b08fc1f39ff"
        name                   = "redis-eks-cluster-cluster-20250422121222134100000009"
        tags                   = {
            "Name" = "redis-eks-cluster-cluster"
        }
      ~ tags_all               = {
          + "Team"        = "SRE/Devops"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group.node[0] will be updated in-place
  ~ resource "aws_security_group" "node" {
        id                     = "sg-03ee6c230327a303a"
        name                   = "redis-eks-cluster-node-2025042212122284120000000a"
        tags                   = {
            "Name"                                    = "redis-eks-cluster-node"
            "kubernetes.io/cluster/redis-eks-cluster" = "owned"
        }
      ~ tags_all               = {
          + "Team"                                    = "SRE/Devops"
            # (5 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_cloudwatch_log_group.flow_log[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "flow_log" {
        id                = "/aws/vpc-flow-log/vpc-099c79fef1ac5dad0"
        name              = "/aws/vpc-flow-log/vpc-099c79fef1ac5dad0"
        tags              = {}
      ~ tags_all          = {
          + "Team"        = "SRE/Devops"
            # (3 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_default_network_acl.this[0] will be updated in-place
  ~ resource "aws_default_network_acl" "this" {
        id                     = "acl-09518bc61113f79d1"
        tags                   = {
            "Name" = "redis-vpc-default"
        }
      ~ tags_all               = {
          + "Team"        = "SRE/Devops"
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.vpc.module.vpc.aws_default_route_table.default[0] will be updated in-place
  ~ resource "aws_default_route_table" "default" {
        id                     = "rtb-03f0bb485bb877b6f"
        tags                   = {
            "Name" = "redis-vpc-default"
        }
      ~ tags_all               = {
          + "Team"        = "SRE/Devops"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.module.vpc.aws_default_security_group.this[0] will be updated in-place
  ~ resource "aws_default_security_group" "this" {
        id                     = "sg-04ac9a802bc81ddfc"
        name                   = "default"
        tags                   = {
            "Name" = "redis-vpc-default"
        }
      ~ tags_all               = {
          + "Team"        = "SRE/Devops"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                       = "eipalloc-0986997a85b639bb8"
        tags                     = {
            "Name" = "redis-vpc-us-east-1a"
        }
      ~ tags_all                 = {
          + "Team"        = "SRE/Devops"
            # (4 unchanged elements hidden)
        }
        # (17 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_flow_log.this[0] will be updated in-place
  ~ resource "aws_flow_log" "this" {
        id                         = "fl-087c7f69e162d5442"
        tags                       = {}
      ~ tags_all                   = {
          + "Team"        = "SRE/Devops"
            # (3 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0] will be updated in-place
  ~ resource "aws_iam_policy" "vpc_flow_log_cloudwatch" {
        id               = "arn:aws:iam::692975265565:policy/vpc-flow-log-to-cloudwatch-2025042212122440990000000c"
        name             = "vpc-flow-log-to-cloudwatch-2025042212122440990000000c"
        tags             = {}
      ~ tags_all         = {
          + "Team"        = "SRE/Devops"
            # (3 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0] will be updated in-place
  ~ resource "aws_iam_role" "vpc_flow_log_cloudwatch" {
        id                    = "vpc-flow-log-role-20250422121209676000000001"
        name                  = "vpc-flow-log-role-20250422121209676000000001"
        tags                  = {}
      ~ tags_all              = {
          + "Team"        = "SRE/Devops"
            # (3 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-096c467443065e040"
        tags     = {
            "Name" = "redis-vpc"
        }
      ~ tags_all = {
          + "Team"        = "SRE/Devops"
            # (4 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_nat_gateway.this[0] will be updated in-place
  ~ resource "aws_nat_gateway" "this" {
        id                                 = "nat-04ff02eac8478a99a"
        tags                               = {
            "Name" = "redis-vpc-us-east-1a"
        }
      ~ tags_all                           = {
          + "Team"        = "SRE/Devops"
            # (4 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0787053b45f8a1da6"
        tags             = {
            "Name" = "redis-vpc-private"
        }
      ~ tags_all         = {
          + "Team"        = "SRE/Devops"
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-03d87976d856d74d2"
        tags             = {
            "Name" = "redis-vpc-public"
        }
      ~ tags_all         = {
          + "Team"        = "SRE/Devops"
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0ead3f63ba5e57089"
        tags                                           = {
            "Name"                            = "redis-vpc-private-us-east-1a"
            "kubernetes.io/role/internal-elb" = "1"
        }
      ~ tags_all                                       = {
          + "Team"                            = "SRE/Devops"
            # (5 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-00479278df7ed535f"
        tags                                           = {
            "Name"                            = "redis-vpc-private-us-east-1b"
            "kubernetes.io/role/internal-elb" = "1"
        }
      ~ tags_all                                       = {
          + "Team"                            = "SRE/Devops"
            # (5 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0ba904340fb504f9f"
        tags                                           = {
            "Name"                   = "redis-vpc-public-us-east-1a"
            "kubernetes.io/role/elb" = "1"
        }
      ~ tags_all                                       = {
          + "Team"                   = "SRE/Devops"
            # (5 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0c3ce30deb00138a4"
        tags                                           = {
            "Name"                   = "redis-vpc-public-us-east-1b"
            "kubernetes.io/role/elb" = "1"
        }
      ~ tags_all                                       = {
          + "Team"                   = "SRE/Devops"
            # (5 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                                   = "vpc-099c79fef1ac5dad0"
        tags                                 = {
            "Name" = "redis-vpc"
        }
      ~ tags_all                             = {
          + "Team"        = "SRE/Devops"
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # module.eks.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0] will be updated in-place
  ~ resource "aws_eks_node_group" "this" {
        id                     = "redis-eks-cluster:managed-node-group-20250422122308968300000019"
        tags                   = {
            "Name" = "managed-node-group"
        }
      ~ tags_all               = {
          + "Team"        = "SRE/Devops"
            # (4 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.eks.module.eks.module.eks_managed_node_group["main"].aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
        id                    = "managed-node-group-eks-node-group-2025042212122757850000000f"
        name                  = "managed-node-group-eks-node-group-2025042212122757850000000f"
        tags                  = {}
      ~ tags_all              = {
          + "Team"        = "SRE/Devops"
            # (3 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.eks.module.eks.module.eks_managed_node_group["main"].aws_launch_template.this[0] will be updated in-place
  ~ resource "aws_launch_template" "this" {
        id                                   = "lt-097ecaa1c08e7b660"
        name                                 = "main-20250422122302835800000017"
        tags                                 = {}
      ~ tags_all                             = {
          + "Team"        = "SRE/Devops"
            # (3 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.eks.module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
        id                                 = "9d97f51e-ef45-4224-8c75-136ebf0d41ce"
        tags                               = {
            "terraform-aws-modules" = "eks"
        }
      ~ tags_all                           = {
          + "Team"                  = "SRE/Devops"
            # (4 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)
    }

Plan: 0 to add, 35 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```